Luke-li-Chen/STM32_BSP/STM32_BSP/User/BSP_C/led/bsp_led.h
#ifndef __LED_H
#define __LED_H

#include "stm32f4xx.h"

#ifdef __cplusplus
extern "C" {
#endif

// 引脚定义
/*******************************************************/
// R 红色灯
#define LED1_PIN                  GPIO_Pin_10
#define LED1_GPIO_PORT            GPIOH
#define LED1_GPIO_CLK             RCC_AHB1Periph_GPIOH

// G 绿色灯
#define LED2_PIN                  GPIO_Pin_11
#define LED2_GPIO_PORT            GPIOH
#define LED2_GPIO_CLK             RCC_AHB1Periph_GPIOH

// B 蓝色灯
#define LED3_PIN                  GPIO_Pin_12
#define LED3_GPIO_PORT            GPIOH
#define LED3_GPIO_CLK             RCC_AHB1Periph_GPIOH

// 小指示灯
#define LED4_PIN                  GPIO_Pin_11
#define LED4_GPIO_PORT            GPIOD
#define LED4_GPIO_CLK             RCC_AHB1Periph_GPIOD
/************************************************************/


/** 控制 LED 灯亮灭的宏，
  * LED 低电平亮，设置 ON = 0，OFF = 1
  * 若 LED 高电平亮，把宏设置成 ON = 1，OFF = 0 即可
  */
#define ON  0
#define OFF 1

/* 带参宏，可以像内联函数一样使用 */
#define LED1(a) if (a)  \
                    GPIO_SetBits(LED1_GPIO_PORT,LED1_PIN);  \
                else  \
                    GPIO_ResetBits(LED1_GPIO_PORT,LED1_PIN)

#define LED2(a) if (a)  \
                    GPIO_SetBits(LED2_GPIO_PORT,LED2_PIN);  \
                else  \
                    GPIO_ResetBits(LED2_GPIO_PORT,LED2_PIN)

#define LED3(a) if (a)  \
                    GPIO_SetBits(LED3_GPIO_PORT,LED3_PIN);  \
                else  \
                    GPIO_ResetBits(LED3_GPIO_PORT,LED3_PIN)

#define LED4(a) if (a)  \
                    GPIO_SetBits(LED4_GPIO_PORT,LED4_PIN);  \
                else  \
                    GPIO_ResetBits(LED4_GPIO_PORT,LED4_PIN)


/* 直接操作寄存器的方法控制 IO */
#define digitalHi(p,i)      { p->BSRRL = i; }   //输出高电平
#define digitalLo(p,i)      { p->BSRRH = i; }   //输出低电平
#define digitalToggle(p,i)  { p->ODR  ^= i; }   //输出反转


/* 定义控制 IO 的宏 */
#define LED1_TOGGLE     digitalToggle(LED1_GPIO_PORT, LED1_PIN)
#define LED1_OFF        digitalHi(LED1_GPIO_PORT, LED1_PIN)
#define LED1_ON         digitalLo(LED1_GPIO_PORT, LED1_PIN)

#define LED2_TOGGLE     digitalToggle(LED2_GPIO_PORT, LED2_PIN)
#define LED2_OFF        digitalHi(LED2_GPIO_PORT, LED2_PIN)
#define LED2_ON         digitalLo(LED2_GPIO_PORT, LED2_PIN)

#define LED3_TOGGLE     digitalToggle(LED3_GPIO_PORT, LED3_PIN)
#define LED3_OFF        digitalHi(LED3_GPIO_PORT, LED3_PIN)
#define LED3_ON         digitalLo(LED3_GPIO_PORT, LED3_PIN)

#define LED4_TOGGLE     digitalToggle(LED4_GPIO_PORT, LED4_PIN)
#define LED4_OFF        digitalHi(LED4_GPIO_PORT, LED4_PIN)
#define LED4_ON         digitalLo(LED4_GPIO_PORT, LED4_PIN)


/* 基本混色 */

// 红
#define LED_RED     \
            LED1_ON;\
            LED2_OFF\
            LED3_OFF

// 绿
#define LED_GREEN   \
            LED1_OFF;\
            LED2_ON\
            LED3_OFF

// 蓝
#define LED_BLUE    \
            LED1_OFF;\
            LED2_OFF\
            LED3_ON

// 黄(红+绿)
#define LED_YELLOW  \
            LED1_ON;\
            LED2_ON\
            LED3_OFF
// 紫(红+蓝)
#define LED_PURPLE  \
            LED1_ON;\
            LED2_OFF\
            LED3_ON

// 青(绿+蓝)
#define LED_CYAN    \
            LED1_OFF;\
            LED2_ON\
            LED3_ON

// 白(红+绿+蓝)
#define LED_WHITE   \
            LED1_ON;\
            LED2_ON\
            LED3_ON

// 黑(全部关闭)
#define LED_RGBOFF  \
            LED1_OFF;\
            LED2_OFF\
            LED3_OFF


void LED_GPIO_Config(void);

#ifdef __cplusplus
}
#endif

#endif  /* __LED_H */
